UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_ТипДокументаОтчетаКомиссионера/рар_мп_ТипДокументаОтчетаКомиссионера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_ТипДокументаОтчетаКомиссионера</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Wildberries_ОбоснованиеДляОплаты/рар_мп_Wildberries_ОбоснованиеДляОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Wildberries_ОбоснованиеДляОплаты</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Логистика</name>
  </enumValues>
  <enumValues>
    <name>ВозмещениеИздержек</name>
  </enumValues>
  <enumValues>
    <name>ВозмещениеЗаВыдачу</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Штраф</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияУщерба</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/ОтчетКомиссионера/ОтчетКомиссионера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="319b18a1-cc82-48d9-8160-65a0c64d1318">
  <name>ОтчетКомиссионера</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>рар_мп_СозданоОбработкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/CommonModules/рар_мп_ОтчетКомиссионера/Module.bsl
#Область ЯндексМаркет

Функция ПолучитьОтчетКомиссионера_ЯндексМаркет(Аккаунт, МесяцГод, campaignId) Экспорт
	
	ОтчетыЯндекс = ПолучитьОтчеты_ЯндексМаркет(Аккаунт, campaignId, МесяцГод);
	
	ПутьОтчетПоРеализации = ПолучитьПутьКОтчету_ЯндексМаркет(ОтчетыЯндекс);
	
	ТабЗначДанных = Новый ТаблицаЗначений;
	
	ТабЗначДанных.Колонки.Добавить("НомерСтроки", 				Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ТипДокумента", 				Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_ТипДокументаОтчетаКомиссионера"));
	ТабЗначДанных.Колонки.Добавить("НомерЗаказа", 				Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("SKU", 						Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("Номенклатура", 				Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗначДанных.Колонки.Добавить("ЕдиницаИзмерения", 			Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТабЗначДанных.Колонки.Добавить("Характеристика", 			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗначДанных.Колонки.Добавить("Продано", 					Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ЦенаЗаШтукуБезУчетаСкидок", Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ЦенаЗаШтукуСУчетомСкидок", 	Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ЦенаСуммаБезУчетаСкидок", 	Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ЦенаСуммаСУчетомСкидок", 	Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.SKUТовара КАК SKUТовара,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт = &Аккаунт";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставленныхТоваров = РезультатЗапроса.Выгрузить();
	
	ПолучитьДанныеИзОтчетаПоРеализации_ЯндексМаркет(Аккаунт, ПутьОтчетПоРеализации, ТабЗначДанных, ВыборкаСопоставленныхТоваров);
	
	Возврат ТабЗначДанных;
	
КонецФункции

Функция ПолучитьОтчеты_ЯндексМаркет(Аккаунт, campaignId, МесяцГод)
	
	МассивФайлов = Новый Массив;
	
	HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьОтчетПоРеализации(Аккаунт, campaignId, Год(МесяцГод), Месяц(МесяцГод));
	
	КодЗапроса = HTTPОтвет.КодСостояния;
	
	Если HTTPОтвет.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса <> 200 Тогда
			
			НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
			
			ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
										Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
			
			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
			
			МассивФайлов.Очистить();
			
			Возврат МассивФайлов;
			
		Иначе
			
			Если HTTPОтвет.ОтветAPI.status = "OK" Тогда
				
				Если HTTPОтвет.ОтветAPI.result.Свойство("reportId") Тогда
					
					НомерОтчета = HTTPОтвет.ОтветAPI.result.reportId;
					
					Статус = "";
					
					Пока Статус <> "DONE" И Статус <> "FAILED" Цикл
						
						HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьГотовыйОтчет(Аккаунт, НомерОтчета);
						
						КодЗапроса = HTTPОтвет.КодСостояния;
						
						Если HTTPОтвет.Свойство("ОтветAPI") Тогда
							
							Если КодЗапроса <> 200 Тогда
								
								НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
								
								ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
								
								Сообщение = Новый СообщениеПользователю;
								Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
								Сообщение.Сообщить();
								
								Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
															Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
								
								ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
								
								МассивФайлов.Очистить();
								
								Возврат МассивФайлов;
								
							Иначе
								
								Статус = HTTPОтвет.ОтветAPI.result.status;	
								
							КонецЕсли;
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
							
							ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
														Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							МассивФайлов.Очистить();
							
							Возврат МассивФайлов;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если Статус = "DONE" Тогда
						
						Если Не HTTPОтвет.ОтветAPI.result.Свойство("subStatus") Тогда
							
							СсылкаНаФайл = HTTPОтвет.ОтветAPI.result.file;
							
							СсылкаНаСоединение = "market-mbi-prod.s3-private.mds.yandex.net";
							
							СсылкаНаФайл = СтрЗаменить(СсылкаНаФайл, "https://" + СсылкаНаСоединение + "/", "");
							
							Соединение = Новый HTTPСоединение(СсылкаНаСоединение, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
							Запрос = Новый HTTPЗапрос(СсылкаНаФайл);
							Ответ = Соединение.Получить(Запрос);
							ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
							
							МассивФайлов.Добавить(ДвоичныеДанные);	
							
						Иначе
							
							НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
							
							ОписаниеОшибки = СтрШаблон("Подстатус генерации отчета: %1", HTTPОтвет.ОтветAPI.result.subStatus);	
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
							Сообщение.Сообщить();
							
							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
							Символы.ПС, Аккаунт, ОписаниеОшибки);
							
							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
							
							МассивФайлов.Очистить();
							
							Возврат МассивФайлов;
							
						КонецЕсли;
						
					Иначе
						
						НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
						
						ОписаниеОшибки = "Статус получения отчета по реализации 'FAILED'";	
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
													Символы.ПС, Аккаунт, ОписаниеОшибки);
						
						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
						
						МассивФайлов.Очистить();
						
						Возврат МассивФайлов;
						
					КонецЕсли;
					
				Иначе
					
					НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
					
					ОписаниеОшибки = ОписаниеОшибки();	
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
												Символы.ПС, Аккаунт, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
					МассивФайлов.Очистить();
					
					Возврат МассивФайлов;
					
				КонецЕсли;
				
			Иначе
				
				НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
				
				ОписаниеОшибки = "При обработке запроса произошла ошибка";	
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
											Символы.ПС, Аккаунт, ОписаниеОшибки);
				
				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
				
				МассивФайлов.Очистить();
				
				Возврат МассивФайлов;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении отчета по реализации в Яндекс Маркет";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении отчета по реализации. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
									Символы.ПС, Аккаунт, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
		МассивФайлов.Очистить();
		
		Возврат МассивФайлов;
		
	КонецЕсли;
	
	//HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьОтчетПоСтоимостиУслуг(Аккаунт, campaignId, НачалоМесяца(МесяцГод), КонецМесяца(МесяцГод));
	//
	//КодЗапроса = HTTPОтвет.КодСостояния;
	//
	//Если HTTPОтвет.Свойство("ОтветAPI") Тогда
	//	
	//	Если КодЗапроса <> 200 Тогда
	//		
	//		НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//		
	//		ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//		Сообщение.Сообщить();
	//		
	//		Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
	//									Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
	//		
	//		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//		
	//		МассивФайлов.Очистить();
	//		
	//		Возврат МассивФайлов;
	//		
	//	Иначе
	//		
	//		Если HTTPОтвет.ОтветAPI.status = "OK" Тогда
	//			
	//			Если HTTPОтвет.ОтветAPI.result.Свойство("reportId") Тогда
	//				
	//				НомерОтчета = HTTPОтвет.ОтветAPI.result.reportId;
	//				
	//				Статус = "";
	//				
	//				Пока Статус <> "DONE" И Статус <> "FAILED" Цикл
	//					
	//					HTTPОтвет = рар_мп_ЯндексМаркет_Методы.Метод_ПолучитьГотовыйОтчет(Аккаунт, НомерОтчета);
	//					
	//					КодЗапроса = HTTPОтвет.КодСостояния;
	//					
	//					Если HTTPОтвет.Свойство("ОтветAPI") Тогда
	//						
	//						Если КодЗапроса <> 200 Тогда
	//							
	//							НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//							
	//							ОписаниеОшибки = HTTPОтвет.ОтветAPI.errors.Получить(0).message;	
	//							
	//							Сообщение = Новый СообщениеПользователю;
	//							Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//							Сообщение.Сообщить();
	//							
	//							Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Код состояния: %3%1Описание ошибки: %4", 
	//														Символы.ПС, Аккаунт, КодЗапроса, ОписаниеОшибки);
	//							
	//							ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//							
	//							МассивФайлов.Очистить();
	//							
	//							Возврат МассивФайлов;
	//							
	//						Иначе
	//							
	//							Статус = HTTPОтвет.ОтветAPI.result.status;	
	//							
	//						КонецЕсли;
	//						
	//					Иначе
	//						
	//						НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//						
	//						ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
	//						
	//						Сообщение = Новый СообщениеПользователю;
	//						Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//						Сообщение.Сообщить();
	//						
	//						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
	//													Символы.ПС, Аккаунт, ОписаниеОшибки);
	//						
	//						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//						
	//						МассивФайлов.Очистить();
	//						
	//						Возврат МассивФайлов;
	//						
	//					КонецЕсли;
	//					
	//				КонецЦикла;
	//				
	//				Если Статус = "DONE" Тогда
	//					
	//					Если Не HTTPОтвет.ОтветAPI.result.Свойство("subStatus") Тогда
	//						
	//						СсылкаНаФайл = HTTPОтвет.ОтветAPI.result.file;
	//						
	//						СсылкаНаСоединение = "market-mbi-prod.s3-private.mds.yandex.net";
	//						
	//						СсылкаНаФайл = СтрЗаменить(СсылкаНаФайл, "https://" + СсылкаНаСоединение + "/", "");
	//						
	//						Соединение = Новый HTTPСоединение(СсылкаНаСоединение, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	//						Запрос = Новый HTTPЗапрос(СсылкаНаФайл);
	//						Ответ = Соединение.Получить(Запрос);
	//						ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	//						
	//						МассивФайлов.Добавить(ДвоичныеДанные);
	//						
	//					Иначе
	//						
	//						НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//						
	//						ОписаниеОшибки = СтрШаблон("Подстатус генерации отчета: %1", HTTPОтвет.ОтветAPI.result.subStatus);	
	//						
	//						Сообщение = Новый СообщениеПользователю;
	//						Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//						Сообщение.Сообщить();
	//						
	//						Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
	//						Символы.ПС, Аккаунт, ОписаниеОшибки);
	//						
	//						ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//						
	//						МассивФайлов.Очистить();
	//						
	//						Возврат МассивФайлов;
	//						
	//					КонецЕсли;
	//					
	//				Иначе
	//					
	//					НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//					
	//					ОписаниеОшибки = "Статус получения отчета по стоимости услуг 'FAILED'";	
	//					
	//					Сообщение = Новый СообщениеПользователю;
	//					Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//					Сообщение.Сообщить();
	//					
	//					Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
	//												Символы.ПС, Аккаунт, ОписаниеОшибки);
	//					
	//					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//					
	//					МассивФайлов.Очистить();
	//					
	//					Возврат МассивФайлов;
	//					
	//				КонецЕсли;
	//				
	//			Иначе
	//				
	//				НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//				
	//				ОписаниеОшибки = ОписаниеОшибки();	
	//				
	//				Сообщение = Новый СообщениеПользователю;
	//				Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//				Сообщение.Сообщить();
	//				
	//				Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
	//											Символы.ПС, Аккаунт, ОписаниеОшибки);
	//				
	//				ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//				
	//				МассивФайлов.Очистить();
	//				
	//				Возврат МассивФайлов;
	//				
	//			КонецЕсли;
	//			
	//		Иначе
	//			
	//			НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//			
	//			ОписаниеОшибки = "При обработке запроса произошла ошибка";	
	//			
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//			Сообщение.Сообщить();
	//			
	//			Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
	//										Символы.ПС, Аккаунт, ОписаниеОшибки);
	//			
	//			ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//			
	//			МассивФайлов.Очистить();
	//			
	//			Возврат МассивФайлов;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	НазваниеОшибки = "Ошибка при получении отчета по стоимости услуг в Яндекс Маркет";
	//	
	//	ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Ошибка при получении отчета по стоимости услуг. Подробное описание ошибки можно посмотреть в журнале регистрации";
	//	Сообщение.Сообщить();
	//	
	//	Комментарий = СтрШаблон("Маркетплейс: Яндекс Маркет%1Аккаунт: %2%1Описание ошибки: %3", 
	//								Символы.ПС, Аккаунт, ОписаниеОшибки);
	//	
	//	ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
	//	
	//	МассивФайлов.Очистить();
	//	
	//	Возврат МассивФайлов;
	//	
	//КонецЕсли;
	
	ВремяОжидания = 60;
	
	ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
	
	Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
		// Ожидаем время для следующего запроса	
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции

Функция ПолучитьПутьКОтчету_ЯндексМаркет(МассивОтчетов)
	
	Путь = "";
	
	Отчет = МассивОтчетов.Получить(0);
	
	Путь = ПолучитьИмяВременногоФайла("xlsx");
	
	Отчет.Записать(Путь);
	
	Возврат Путь;
	
КонецФункции

Процедура ПолучитьДанныеИзОтчетаПоРеализации_ЯндексМаркет(Аккаунт, ПутьКФайлу, ТабЗначДанных, СопоставленныеТовары)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение                                                       
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать отчет по реализации. Подробное описание можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка при чтении данных из отчета по реализации. Отчет комиссионера Яндекс Маркет", 
									УровеньЖурналаРегистрации.Ошибка,,,
									СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
		
	КонецПопытки;
	
	ОбластьДоставленныеТовары = ТабДок.Области["Доставленные_товары"];
	
	// Область Доставленные товары
	ПерваяСтрока 	= ОбластьДоставленныеТовары.Верх;
	ПоследняяСтрока = ОбластьДоставленныеТовары.Низ;
	
	Смещение = 0;
	
	Для НомерСтроки = ПерваяСтрока По ПоследняяСтрока - 1 Цикл
		
		marketId = ДанныеЯчейки(ТабДок, НомерСтроки, 1, 0);
		Если Не ЗначениеЗаполнено(marketId) Или marketId = "Заказы" Или marketId = "Доставленные товары" 
			Или marketId = "Данные сформированы на основе даты доставки товара покупателю.
							|
							|Рекомендуем отражать выручку от продажи за отчётный период по данным ваших учётных систем, с этим отчётом только сверяться." Тогда
			Продолжить;	
		КонецЕсли;
		Если marketId = "Номер заказа" Тогда
			КолонкаТипЗаказа = ДанныеЯчейки(ТабДок, НомерСтроки, 2, 0);
			Если Не КолонкаТипЗаказа = "Тип заказа" Тогда
				Смещение = 1;	
			КонецЕсли;
			Продолжить;	
		КонецЕсли;
		
		Попытка
			
			НоваяСтрока = ТабЗначДанных.Добавить();
			НоваяСтрока.НомерСтроки 	= ТабЗначДанных.Количество();
			НоваяСтрока.ТипДокумента 	= Перечисления.рар_мп_ТипДокументаОтчетаКомиссионера.Продажа;
			НоваяСтрока.НомерЗаказа		= ДанныеЯчейки(ТабДок, НомерСтроки, 1, Смещение);
			НоваяСтрока.SKU				= ДанныеЯчейки(ТабДок, НомерСтроки, 4, Смещение);
			
			НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", НоваяСтрока.SKU));
			
			Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
				НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
				НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с sku: %1 в сопоставленных товарах (строка №%2)", НоваяСтрока.SKU, НоваяСтрока.НомерСтроки);
				Сообщение.Сообщить();
			КонецЕсли;
			
			НоваяСтрока.Продано 					= ДанныеЯчейки(ТабДок, НомерСтроки, 7, Смещение);
			НоваяСтрока.ЦенаЗаШтукуБезУчетаСкидок 	= ДанныеЯчейки(ТабДок, НомерСтроки, 13, Смещение);
			НоваяСтрока.ЦенаЗаШтукуСУчетомСкидок 	= ДанныеЯчейки(ТабДок, НомерСтроки, 17, Смещение);
			НоваяСтрока.ЦенаСуммаБезУчетаСкидок 	= ДанныеЯчейки(ТабДок, НомерСтроки, 18, Смещение);
			НоваяСтрока.ЦенаСуммаСУчетомСкидок 		= ДанныеЯчейки(ТабДок, НомерСтроки, 20, Смещение);
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с sku: %1", ДанныеЯчейки(ТабДок, НомерСтроки, 4, Смещение));
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Отчет комиссионера Яндекс Маркет", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
					
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОтчетКомиссионера_ЯндексМаркет(Период, Данные, АккаунтМаркетплейса) Экспорт
	
	НовыйДокумент = Документы.ОтчетКомиссионера.СоздатьДокумент();
	
	СтавкаНДСВознаграждения = АккаунтМаркетплейса.СтавкаНДСВознаграждения.Ставка;
	
	// Заполнить документ!
	НовыйДокумент.Дата 							= ТекущаяДатаСеанса();
	НовыйДокумент.ХозяйственнаяОперация 		= АккаунтМаркетплейса.ОперацияОтчетКомиссионера;
	НовыйДокумент.НачалоПериода 				= НачалоМесяца(Период);
	НовыйДокумент.КонецПериода 					= КонецМесяца(Период);
	НовыйДокумент.Организация 					= АккаунтМаркетплейса.Организация;
	НовыйДокумент.Партнер 						= АккаунтМаркетплейса.Контрагент.Партнер;
	НовыйДокумент.Контрагент 					= АккаунтМаркетплейса.Контрагент;
	НовыйДокумент.Соглашение 					= АккаунтМаркетплейса.Соглашение;
	НовыйДокумент.Договор 						= АккаунтМаркетплейса.Договор;
	НовыйДокумент.Валюта 						= АккаунтМаркетплейса.Валюта;
	НовыйДокумент.ЦенаВключаетНДС 				= Истина;
	НовыйДокумент.Услуга						= АккаунтМаркетплейса.Услуга;
	НовыйДокумент.СтатьяРасходов				= АккаунтМаркетплейса.СтатьяРасходов;
	НовыйДокумент.СпособРасчетаВознаграждения 	= ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи");
	НовыйДокумент.ПроцентВознаграждения			= 0;
	НовыйДокумент.СтавкаНДСВознаграждения		= АккаунтМаркетплейса.СтавкаНДСВознаграждения;
	НовыйДокумент.СуммаНДСВознаграждения		= НовыйДокумент.СуммаВознаграждения / (100 + СтавкаНДСВознаграждения) * СтавкаНДСВознаграждения;
	НовыйДокумент.НалогообложениеНДС 			= АккаунтМаркетплейса.НалогообложениеНДС;
	НовыйДокумент.Менеджер						= АккаунтМаркетплейса.Менеджер;
	НовыйДокумент.Подразделение					= АккаунтМаркетплейса.Подразделение;
	НовыйДокумент.рар_мп_СозданоОбработкой		= Истина;
	НовыйДокумент.рар_мп_АккаунтМаркетплейса	= АккаунтМаркетплейса;
	
	КомиссионнаяТорговляСервер.ЗаполнитьСтавкуНДСкомиссионногоВознаграждения(НовыйДокумент, СтавкаНДСВознаграждения);
	
	Для каждого Строка Из Данные Цикл
		
		СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "СтавкаНДС");
		ЗначениеСтавкиНДС = СтавкаНДС.Ставка;
		
		СтрокаТЧДокумента = НовыйДокумент.Товары.Добавить();
		СтрокаТЧДокумента.Номенклатура 				= Строка.Номенклатура;
		СтрокаТЧДокумента.Упаковка 					= Строка.ЕдиницаИзмерения;
		СтрокаТЧДокумента.Характеристика 			= Строка.Характеристика;
		СтрокаТЧДокумента.КоличествоУпаковок 		= Строка.Продано;
		СтрокаТЧДокумента.КоличествоУпаковокУчет 	= Строка.Продано;
		СтрокаТЧДокумента.Количество 				= Строка.Продано;
		СтрокаТЧДокумента.Цена 						= Строка.ЦенаЗаШтукуБезУчетаСкидок;
		СтрокаТЧДокумента.ЦенаПродажи 				= Строка.ЦенаЗаШтукуСУчетомСкидок;
		СтрокаТЧДокумента.Сумма 					= Строка.ЦенаСуммаБезУчетаСкидок;
		СтрокаТЧДокумента.СуммаПродажи 				= Строка.ЦенаСуммаСУчетомСкидок;
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
	НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
	ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
	НовыйДокумент.ЦенаВключаетНДС));	
	СтруктураДействий.Вставить("ПересчитатьСуммуПродажиНДС");
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Отчет комиссионера создан");
		Сообщение.Сообщить();
	
	Исключение
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось провести отчет комиссионера. Подробное описание можно посмотреть в журнале регистрации");
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Не удалось провести отчет комиссионера Яндекс Маркет", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
	
	КонецПопытки;
								
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

Функция ДанныеЯчейки(ТабличныйДокумент, НомерСтроки, НомерКолонки, Смещение)
	Возврат Строка(ТабличныйДокумент.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + (НомерКолонки + Смещение)).ТекущаяОбласть.Текст);	
КонецФункции

#КонецОбласти

#Область Ozon

Функция ПолучитьОтчетКомиссионера_Ozon(Аккаунт, МесяцГод) Экспорт
	
	ТабЗначДанных = Новый ТаблицаЗначений;
	
	ТабЗначДанных.Колонки.Добавить("НомерСтроки", 			Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗначДанных.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТабЗначДанных.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗначДанных.Колонки.Добавить("Артикул");
	ТабЗначДанных.Колонки.Добавить("SKU", 					Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ЦенаПродавцаСУчетомСкидки");
	
	ТабЗначДанных.Колонки.Добавить("РеализованоНаСумму");
	ТабЗначДанных.Колонки.Добавить("ВыплатыОтПартнеров");
	ТабЗначДанных.Колонки.Добавить("ДоплатаЗаСчетOzon");
	ТабЗначДанных.Колонки.Добавить("Количество");
	ТабЗначДанных.Колонки.Добавить("ЦенаРеализации");
	ТабЗначДанных.Колонки.Добавить("ИтогиКомиссияСУчетомСкидокИНаценок");
	ТабЗначДанных.Колонки.Добавить("ИтогиКНачислению");
	
	ТабЗначДанных.Колонки.Добавить("ВозвращеноНаСумму");
	ТабЗначДанных.Колонки.Добавить("ВозвратыВыплатыОтПартнеров");
	ТабЗначДанных.Колонки.Добавить("ВозвратДоплатаЗаСчетOzon");
	ТабЗначДанных.Колонки.Добавить("ВозвратКоличество");
	ТабЗначДанных.Колонки.Добавить("ВозвратЦенаРеализации");
	ТабЗначДанных.Колонки.Добавить("ВозвратИтогиКомиссияСУчетомСкидокИНаценок");
	ТабЗначДанных.Колонки.Добавить("ИтогоВозвращено");
	ТабЗначДанных.Колонки.Добавить("КоличествоВозвратов");
	
	ТабЗначДанных.Колонки.Добавить("НомерОтправления");
	ТабЗначДанных.Колонки.Добавить("ДатаОтправления");
	ТабЗначДанных.Колонки.Добавить("НомерСчетФактуры");
	ТабЗначДанных.Колонки.Добавить("ДатаСчетФактуры");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Ozon_СопоставленныеТовары.SKUТовара КАК SKUТовара,
		|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставленныхТоваров = РезультатЗапроса.Выгрузить();
	
	ОтветныеДанные = рар_мп_Ozon_Методы.Метод_ПозаказныйОтчетОРеализацииТоваров(Аккаунт, Год(МесяцГод), Месяц(МесяцГод));
	
	Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
		
		Если ОтветныеДанные.КодСостояния <> 200 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных. Ошибка: %1 (код ошибки: %2). Подробное описание можно посмотреть в журнале регистрации", 
			ОтветныеДанные.Заголовки, ОтветныеДанные.КодСостояния);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных. Отчет комиссионера Ozon", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОтветныеДанные.ОтветAPI.message));
			
		Иначе
			
			Если ОтветныеДанные.ОтветAPI.Количество() <> 0 Тогда
				
				ПолучениеДанныхИзОтчетаКомиссионера_Ozon(ОтветныеДанные.ОтветAPI, ВыборкаСопоставленныхТоваров, ТабЗначДанных, Аккаунт);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении данных в Ozon";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Ozon%1Аккаунт: %2%1Описание ошибки: %3", 
									Символы.ПС, Аккаунт, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
	КонецЕсли;
	
	Возврат ТабЗначДанных;
	
КонецФункции

Процедура ПолучениеДанныхИзОтчетаКомиссионера_Ozon(ПолученныеДанные, СопоставленныеТовары, ТабЗначДанных, Аккаунт)
	
	Для Каждого СтрокаТЧ Из ПолученныеДанные.rows Цикл
		
		Попытка
				
			НоваяСтрока = ТабЗначДанных.Добавить();
			НоваяСтрока.НомерСтроки 	= ТабЗначДанных.Количество();
			НоваяСтрока.Артикул			= СтрокаТЧ.item.offer_id;
			НоваяСтрока.SKU				= СтрокаТЧ.item.sku;
			
			НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("SKUТовара", Строка(СтрокаТЧ.item.sku)));
			
			Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
				НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
				НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с sku: %1 в сопоставленных товарах (строка №%2)", СтрокаТЧ.item.sku, НоваяСтрока.НомерСтроки);
				Сообщение.Сообщить();
			КонецЕсли;
			
			НоваяСтрока.ЦенаПродавцаСУчетомСкидки			= СтрокаТЧ.seller_price_per_instance;
			
			НоваяСтрока.РеализованоНаСумму 					= СтрокаТЧ.delivery_commission.amount;
			НоваяСтрока.ВыплатыОтПартнеров 					= СтрокаТЧ.delivery_commission.bank_coinvestment +
																СтрокаТЧ.delivery_commission.stars +
																СтрокаТЧ.delivery_commission.pick_up_point_coinvestment;
			НоваяСтрока.ДоплатаЗаСчетOzon 					= СтрокаТЧ.delivery_commission.compensation;
			НоваяСтрока.Количество 							= СтрокаТЧ.delivery_commission.quantity;
			НоваяСтрока.ЦенаРеализации 						= СтрокаТЧ.delivery_commission.price_per_instance;
			НоваяСтрока.ИтогиКомиссияСУчетомСкидокИНаценок 	= СтрокаТЧ.delivery_commission.standard_fee;
			НоваяСтрока.ИтогиКНачислению 					= СтрокаТЧ.delivery_commission.total;
			
			Если СтрокаТЧ.return_commission <> Неопределено Тогда
				
				НоваяСтрока.ВозвращеноНаСумму 							= СтрокаТЧ.return_commission.amount;
				НоваяСтрока.ВозвратыВыплатыОтПартнеров 					= СтрокаТЧ.return_commission.bank_coinvestment +
																			СтрокаТЧ.return_commission.stars +
																			СтрокаТЧ.return_commission.pick_up_point_coinvestment;
				НоваяСтрока.ВозвратДоплатаЗаСчетOzon 					= СтрокаТЧ.return_commission.compensation;
				НоваяСтрока.ВозвратКоличество 							= СтрокаТЧ.return_commission.quantity;
				НоваяСтрока.ВозвратЦенаРеализации 						= СтрокаТЧ.return_commission.price_per_instance;
				НоваяСтрока.ВозвратИтогиКомиссияСУчетомСкидокИНаценок 	= СтрокаТЧ.return_commission.standard_fee;
				НоваяСтрока.ИтогоВозвращено 							= СтрокаТЧ.return_commission.total;
				НоваяСтрока.КоличествоВозвратов							= 1;
				
			КонецЕсли;
			
			НоваяСтрока.НомерОтправления 							= СтрокаТЧ.order.posting_number;
			НоваяСтрока.ДатаОтправления 							= СтрокаТЧ.order.created_date;
			
			Если СтрокаТЧ.legal_entity_document <> Неопределено Тогда
				
				НоваяСтрока.НомерСчетФактуры = СтрокаТЧ.legal_entity_document.number;
				
				Если ЗначениеЗаполнено(СтрокаТЧ.legal_entity_document.sale_date) Тогда
					ПодстрокиДаты = СтрРазделить(СтрокаТЧ.legal_entity_document.sale_date, ".");
					Если ПодстрокиДаты.Количество() = 3 Тогда
						НоваяСтрока.ДатаСчетФактуры = Дата(Число(ПодстрокиДаты[2]), Число(ПодстрокиДаты[1]), Число(ПодстрокиДаты[0]));
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с sku: %1", СтрокаТЧ.item.sku);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Отчет комиссионера Ozon", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОтчетКомиссионера_Ozon(Период, Данные, АккаунтМаркетплейса, СуммаКомиссия) Экспорт
	
	НовыйДокумент = Документы.ОтчетКомиссионера.СоздатьДокумент();
	
	СтавкаНДСВознаграждения = АккаунтМаркетплейса.СтавкаНДСВознаграждения.Ставка;
	
	// Заполнить документ!
	НовыйДокумент.Дата 							= ТекущаяДатаСеанса();
	НовыйДокумент.ХозяйственнаяОперация 		= АккаунтМаркетплейса.ОперацияОтчетКомиссионера;
	НовыйДокумент.НачалоПериода 				= НачалоМесяца(Период);
	НовыйДокумент.КонецПериода 					= КонецМесяца(Период);
	НовыйДокумент.Организация 					= АккаунтМаркетплейса.Организация;
	НовыйДокумент.Партнер 						= АккаунтМаркетплейса.Контрагент.Партнер;
	НовыйДокумент.Контрагент 					= АккаунтМаркетплейса.Контрагент;
	НовыйДокумент.Соглашение 					= АккаунтМаркетплейса.Соглашение;
	НовыйДокумент.Договор 						= АккаунтМаркетплейса.Договор;
	НовыйДокумент.Валюта 						= АккаунтМаркетплейса.Валюта;
	НовыйДокумент.ЦенаВключаетНДС 				= АккаунтМаркетплейса.ЦенаВключаетНДС;
	НовыйДокумент.Услуга						= АккаунтМаркетплейса.Услуга;
	НовыйДокумент.СтатьяРасходов				= АккаунтМаркетплейса.СтатьяРасходов;
	НовыйДокумент.СпособРасчетаВознаграждения 	= ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи");
	НовыйДокумент.ПроцентВознаграждения			= 0;
	//НовыйДокумент.СтавкаНДСВознаграждения		= АккаунтМаркетплейса.СтавкаНДСВознаграждения;
	//НовыйДокумент.СуммаНДСВознаграждения		= НовыйДокумент.СуммаВознаграждения / (100 + СтавкаНДСВознаграждения) * СтавкаНДСВознаграждения;
	НовыйДокумент.НалогообложениеНДС 			= АккаунтМаркетплейса.НалогообложениеНДС;
	НовыйДокумент.Менеджер						= АккаунтМаркетплейса.Менеджер;
	НовыйДокумент.Подразделение					= АккаунтМаркетплейса.Подразделение;
	НовыйДокумент.рар_мп_СозданоОбработкой		= Истина;
	НовыйДокумент.рар_мп_АккаунтМаркетплейса	= АккаунтМаркетплейса;
	
	КомиссионнаяТорговляСервер.ЗаполнитьСтавкуНДСкомиссионногоВознаграждения(НовыйДокумент, СтавкаНДСВознаграждения);
	
	ЗаполнитьТЧОтчетаКомиссионера(НовыйДокумент, Данные, СуммаКомиссия);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
								НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
								ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
								НовыйДокумент.ЦенаВключаетНДС));	
	СтруктураДействий.Вставить("ПересчитатьСуммуПродажиНДС");
								ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	НовыйДокумент.СуммаВознаграждения = НовыйДокумент.Товары.Итог("СуммаВознаграждения");
										НовыйДокумент.СуммаНДСВознаграждения = Окр(НовыйДокумент.СуммаВознаграждения * СтавкаНДСВознаграждения
										/ (100 + СтавкаНДСВознаграждения), 2, РежимОкругления.Окр15как20);
	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Отчет комиссионера создан");
		Сообщение.Сообщить();
	
	Исключение
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось провести отчет комиссионера. Подробное описание можно посмотреть в журнале регистрации");
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Не удалось провести отчет комиссионера Ozon", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
	
	КонецПопытки;
								
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

Процедура ЗаполнитьТЧОтчетаКомиссионера(ОтчетКомиссионера, ТаблицаТранзакций, СуммаКомиссия)

	ОтчетКомиссионера.Товары.Очистить();
	ОтчетКомиссионера.ВидыЗапасов.Очистить();
	
	ОсталосьРаспределить = СуммаКомиссия;
	КоличествоСтрокБезУчетаВозвратов = (ТаблицаТранзакций.Количество() - ТаблицаТранзакций.Итог("КоличествоВозвратов"));
	Если КоличествоСтрокБезУчетаВозвратов = 0  Тогда // Если только 1 возврат?
		Комиссия = СуммаКомиссия;		
	Иначе
		Комиссия = Окр((СуммаКомиссия / КоличествоСтрокБезУчетаВозвратов), 2, 0);
		Если Комиссия * КоличествоСтрокБезУчетаВозвратов > СуммаКомиссия Тогда
			Комиссия = Комиссия - 0.01;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Если Транзакция.Количество = 0 И Транзакция.ВозвратКоличество > 0 Тогда
			КомиссияВСтроке = 0;		
		Иначе
			КомиссияВСтроке = Комиссия;
			Если Транзакция.Количество > 0 И Транзакция.ВозвратКоличество = 0 Тогда
				ОсталосьРаспределить = ОсталосьРаспределить - КомиссияВСтроке;
			КонецЕсли;
		КонецЕсли;
		
		ПродажаПартнеруB2B = ЗначениеЗаполнено(Транзакция.НомерСчетФактуры);
		
		Если Транзакция.Количество > 0 Тогда
			
			ВыплатыОтПартнеров = ?(ПродажаПартнеруB2B, 0, Транзакция.ВыплатыОтПартнеров);
			
			НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			НоваяСтрока.Характеристика 			= Транзакция.Характеристика;
			НоваяСтрока.Упаковка 				= Транзакция.ЕдиницаИзмерения;
			НоваяСтрока.КоличествоУпаковокУчет 	= Транзакция.Количество;
			НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
			НоваяСтрока.Цена 					= Транзакция.ЦенаПродавцаСУчетомСкидки;
			НоваяСтрока.ЦенаПродажи             = (Транзакция.РеализованоНаСумму + ВыплатыОтПартнеров) / Транзакция.Количество;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			НоваяСтрока.СуммаПродажи            = Транзакция.РеализованоНаСумму + ВыплатыОтПартнеров;
			НоваяСтрока.СуммаВознаграждения 	= КомиссияВСтроке;
			
			НоваяСтрока.НомерСчетаФактурыКомиссионера 	= Транзакция.НомерСчетФактуры;
			НоваяСтрока.ДатаСчетаФактурыКомиссионера 	= Транзакция.ДатаСчетФактуры;
			
		КонецЕсли;
		
		Если Транзакция.ВозвратКоличество > 0 Тогда
			
			ВозвратыВыплатыОтПартнеров = ?(ПродажаПартнеруB2B, 0, Транзакция.ВозвратыВыплатыОтПартнеров);
			
			НоваяСтрока = ОтчетКомиссионера.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			НоваяСтрока.Характеристика 			= Транзакция.Характеристика;
			НоваяСтрока.Упаковка 				= Транзакция.ЕдиницаИзмерения;
			НоваяСтрока.КоличествоУпаковокУчет 	= -Транзакция.ВозвратКоличество;
			НоваяСтрока.КоличествоУпаковок 		= -Транзакция.ВозвратКоличество;
			НоваяСтрока.Цена 					= Транзакция.ЦенаПродавцаСУчетомСкидки;
			НоваяСтрока.ЦенаПродажи             = (Транзакция.ВозвращеноНаСумму + ВозвратыВыплатыОтПартнеров) / Транзакция.ВозвратКоличество;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
			НоваяСтрока.СуммаПродажи            = -(Транзакция.ВозвращеноНаСумму + ВозвратыВыплатыОтПартнеров);
			НоваяСтрока.СуммаВознаграждения 	= -(КомиссияВСтроке);	
			
			НоваяСтрока.НомерСчетаФактурыКомиссионера 	= Транзакция.НомерСчетФактуры;
			НоваяСтрока.ДатаСчетаФактурыКомиссионера 	= Транзакция.ДатаСчетФактуры;
		КонецЕсли;
		
	КонецЦикла;

	Если Не ОсталосьРаспределить = 0 Тогда
		НоваяСтрока.СуммаВознаграждения = НоваяСтрока.СуммаВознаграждения + ОсталосьРаспределить;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Wildberries

Функция ПолучитьОтчетКомиссионера_Wildberries(Аккаунт, НачалоПериода, КонецПериода) Экспорт
	
	ТабЗначДанных = Новый ТаблицаЗначений;
	
	ТабЗначДанных.Колонки.Добавить("НомерСтроки", 			Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ТипДокумента", 			Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_ТипДокументаОтчетаКомиссионера"));
	ТабЗначДанных.Колонки.Добавить("ОбоснованиеДляОплаты", 	Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_Wildberries_ОбоснованиеДляОплаты"));
	ТабЗначДанных.Колонки.Добавить("НомерПоставки", 		Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("Артикул", 				Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("Баракод", 				Новый ОписаниеТипов("Строка"));
	ТабЗначДанных.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗначДанных.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТабЗначДанных.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗначДанных.Колонки.Добавить("Продано", 				Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("Цена", 					Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("Сумма", 				Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("ВознаграждениеБезНДС", 	Новый ОписаниеТипов("Число"));
	ТабЗначДанных.Колонки.Добавить("НДССВознаграждения", 	Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Баракод,
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСопоставленныхТоваров = РезультатЗапроса.Выгрузить();
	
	УникальныйИдентификаторСтроки = 0;

	ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПолучениеОтчетаОПродажахПоРеализации(Аккаунт, НачалоПериода, КонецПериода, УникальныйИдентификаторСтроки);
	
	Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
		
		Если ОтветныеДанные.КодСостояния <> 200 Тогда
			
			Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
				ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
			Иначе
				ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при получении данных. Подробное описание можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных. Отчет комиссионера WB", 
										УровеньЖурналаРегистрации.Ошибка,,,
										СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
			
		Иначе
			
			Пока ОтветныеДанные.ОтветAPI.Количество() <> 0 Цикл
				
				ПолучениеДанныхИзОтчетаКомиссионера_Wildberries(ОтветныеДанные.ОтветAPI, УникальныйИдентификаторСтроки, ВыборкаСопоставленныхТоваров, ТабЗначДанных, Аккаунт);
				
				ВремяОжидания = 60;
				
				ВремяСледующегоЗапроса = ТекущаяДата() + ВремяОжидания;
				
				Пока ТекущаяДата() < ВремяСледующегоЗапроса Цикл
					// Ожидаем время для следующего запроса	
				КонецЦикла;
				
				ОтветныеДанные = рар_мп_Wildberries_Методы.Метод_ПолучениеОтчетаОПродажахПоРеализации(Аккаунт, НачалоПериода, КонецПериода, СтрЗаменить(УникальныйИдентификаторСтроки, Символы.НПП, ""));
				
				Если ОтветныеДанные.Свойство("ОтветAPI") Тогда
					
					Если ОтветныеДанные.КодСостояния <> 200 Тогда
						
						Если ОтветныеДанные.ОтветAPI.Свойство("errorText") Тогда
							ОписаниеОшибки = ОтветныеДанные.ОтветAPI.errorText;	
						Иначе
							ОписаниеОшибки = ОтветныеДанные.ОтветAPI.detail;	
						КонецЕсли;
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Ошибка при получении данных. Подробное описание можно посмотреть в журнале регистрации";
						Сообщение.Сообщить();
						
						ЗаписьЖурналаРегистрации("Ошибка при получении данных. Отчет комиссионера WB", 
													УровеньЖурналаРегистрации.Ошибка,,,
													СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки));
						
					КонецЕсли;
												
				Иначе
					
					НазваниеОшибки = "Ошибка при получении данных в Wildberries";
					
					ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
					Сообщение.Сообщить();
					
					Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
												Символы.ПС, Аккаунт, ОписаниеОшибки);
					
					ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		НазваниеОшибки = "Ошибка при получении данных в Wildberries";
		
		ОписаниеОшибки = "Ошибка при получении JSON. Некорректные значения JSON";	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Маркетплейс: Wildberries%1Аккаунт: %2%1Описание ошибки: %3", 
									Символы.ПС, Аккаунт, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(НазваниеОшибки,УровеньЖурналаРегистрации.Ошибка,,,Комментарий,);
		
	КонецЕсли;
	
	Возврат ТабЗначДанных;
	
КонецФункции

Процедура ПолучениеДанныхИзОтчетаКомиссионера_Wildberries(ПолученныеДанные, УникальныйИдентификаторСтроки, СопоставленныеТовары, ТабЗначДанных, Аккаунт)
	
	Для Каждого Строка Из ПолученныеДанные Цикл
		
		УникальныйИдентификаторСтроки = Строка.rrd_id;
		
		Если ЗначениеЗаполнено(Строка.doc_type_name) И ЗначениеЗаполнено(Строка.barcode) Тогда
			
			Если Строка.supplier_oper_name = "Продажа" Или Строка.supplier_oper_name = "Возврат" Тогда
				
				Попытка
					
					НоваяСтрока = ТабЗначДанных.Добавить();
					НоваяСтрока.НомерСтроки = ТабЗначДанных.Количество();
					
					НоваяСтрока.ТипДокумента = Перечисления.рар_мп_ТипДокументаОтчетаКомиссионера[Строка.doc_type_name];
					
					НоваяСтрока.ОбоснованиеДляОплаты = Перечисления.рар_мп_Wildberries_ОбоснованиеДляОплаты[Строка.supplier_oper_name];
					
					НоваяСтрока.Артикул = Строка.nm_id;
					НоваяСтрока.Баракод = Строка.barcode;
						
					НайденныеСтрокиНоменклатуры = СопоставленныеТовары.НайтиСтроки(Новый Структура("Баракод", Строка.barcode));
					
					Если НайденныеСтрокиНоменклатуры.Количество() > 0 Тогда
						НоваяСтрока.Номенклатура 		= НайденныеСтрокиНоменклатуры.Получить(0).Номенклатура;
						НоваяСтрока.ЕдиницаИзмерения 	= НайденныеСтрокиНоменклатуры.Получить(0).ЕдиницаИзмерения;
						НоваяСтрока.Характеристика		= НайденныеСтрокиНоменклатуры.Получить(0).Характеристика;
					Иначе
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("Не удалось найти номенклатуру с баракодом: %1 в сопоставленных товарах (строка №%2)", Строка.barcode, НоваяСтрока.НомерСтроки);
						Сообщение.Сообщить();
					КонецЕсли;
					
					НоваяСтрока.НомерПоставки = Строка.gi_id;
					
					Если Строка.supplier_oper_name = "Продажа" Тогда
						НоваяСтрока.Продано = Строка.quantity;
					ИначеЕсли Строка.supplier_oper_name = "Возврат" Тогда
						НоваяСтрока.Продано = Строка.quantity * (-1);
					КонецЕсли;
					
					
					Если ЗначениеЗаполнено(Строка.retail_price) Тогда
						НоваяСтрока.Цена 	= Строка.retail_price;
						НоваяСтрока.Сумма 	= Строка.quantity * Строка.retail_price;
					Иначе
						НоваяСтрока.Цена 	= Строка.ppvz_for_pay;
						НоваяСтрока.Сумма 	= Строка.quantity * Строка.ppvz_for_pay;
					КонецЕсли;
					
					НоваяСтрока.ВознаграждениеБезНДС 	= Строка.ppvz_vw;
					НоваяСтрока.НДССВознаграждения		= Строка.ppvz_vw_nds;
					
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при получении данных по номенклатуре с баркодом: %1 и номером поставки: %2", Строка.barcode, Строка.gi_id);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации("Ошибка при получении данных по номенклатуре. Отчет комиссионера Wildberries", 
												УровеньЖурналаРегистрации.Ошибка,,,
												СтрШаблон("Аккаунт: %1. Описание ошибки: %2", Аккаунт.Наименование, ОписаниеОшибки()));
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОтчетКомиссионера_Wildberries(Период, Данные, АккаунтМаркетплейса) Экспорт
	
	НовыйДокумент = Документы.ОтчетКомиссионера.СоздатьДокумент();
	
	// Заполнить документ!
	НовыйДокумент.Дата 							= ТекущаяДата();
	НовыйДокумент.ХозяйственнаяОперация 		= АккаунтМаркетплейса.ОперацияОтчетКомиссионера;
	НовыйДокумент.НачалоПериода 				= Период.ДатаНачала;
	НовыйДокумент.КонецПериода 					= Период.ДатаОкончания;
	НовыйДокумент.Организация 					= АккаунтМаркетплейса.Организация;
	НовыйДокумент.Партнер 						= АккаунтМаркетплейса.Контрагент.Партнер;
	НовыйДокумент.Контрагент 					= АккаунтМаркетплейса.Контрагент;
	НовыйДокумент.Соглашение 					= АккаунтМаркетплейса.Соглашение;
	НовыйДокумент.Договор 						= АккаунтМаркетплейса.Договор;
	НовыйДокумент.Валюта 						= АккаунтМаркетплейса.Валюта;
	НовыйДокумент.ЦенаВключаетНДС 				= АккаунтМаркетплейса.ЦенаВключаетНДС;
	НовыйДокумент.Услуга						= АккаунтМаркетплейса.Услуга;
	НовыйДокумент.СтатьяРасходов				= АккаунтМаркетплейса.СтатьяРасходов;
	НовыйДокумент.СпособРасчетаВознаграждения 	= Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроизвольнаяСумма;
	НовыйДокумент.СуммаВознаграждения			= Данные.Итог("ВознаграждениеБезНДС") + Данные.Итог("НДССВознаграждения");
	НовыйДокумент.СтавкаНДСВознаграждения		= АккаунтМаркетплейса.СтавкаНДСВознаграждения;
	НовыйДокумент.СуммаНДСВознаграждения		= Данные.Итог("НДССВознаграждения");
	НовыйДокумент.НалогообложениеНДС 			= АккаунтМаркетплейса.НалогообложениеНДС;
	НовыйДокумент.Менеджер						= АккаунтМаркетплейса.Менеджер;
	НовыйДокумент.Подразделение					= АккаунтМаркетплейса.Подразделение;
	НовыйДокумент.рар_мп_СозданоОбработкой		= Истина;
	НовыйДокумент.рар_мп_АккаунтМаркетплейса	= АккаунтМаркетплейса;
	
	Для каждого Строка Из Данные Цикл
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "СтавкаНДС");
			ЗначениеСтавкиНДС = СтавкаНДС.Ставка;
			
			СтрокаТЧДокумента = НовыйДокумент.Товары.Добавить();
			СтрокаТЧДокумента.Номенклатура 		= Строка.Номенклатура;
			СтрокаТЧДокумента.Упаковка 			= Строка.ЕдиницаИзмерения;
			СтрокаТЧДокумента.Характеристика 	= Строка.Характеристика;
			
			Если Строка.ТипДокумента = Перечисления.рар_мп_ТипДокументаОтчетаКомиссионера.Продажа Тогда
				СтрокаТЧДокумента.КоличествоУпаковок 	= Строка.Продано;
				СтрокаТЧДокумента.Количество 			= Строка.Продано;
			Иначе
				СтрокаТЧДокумента.КоличествоУпаковок 	= Строка.Продано 	* (-1);
				СтрокаТЧДокумента.Количество 			= Строка.Продано  	* (-1);
			КонецЕсли;
			
			СтрокаТЧДокумента.Цена = Строка.Цена;
			
			Если СтрокаТЧДокумента.КоличествоУпаковок < 0 Тогда
				СтрокаТЧДокумента.Сумма = СтрокаТЧДокумента.Цена * (СтрокаТЧДокумента.КоличествоУпаковок * (-1));
			Иначе
				СтрокаТЧДокумента.Сумма = СтрокаТЧДокумента.Цена * СтрокаТЧДокумента.КоличествоУпаковок;
			КонецЕсли;
			
			СтрокаТЧДокумента.ЦенаПродажи 			= Строка.Цена;
			СтрокаТЧДокумента.СуммаПродажиНДС		= УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТЧДокумента.Сумма, Истина, ЗначениеСтавкиНДС);
			СтрокаТЧДокумента.СуммаПродажи 			= СтрокаТЧДокумента.Сумма;
			СтрокаТЧДокумента.СтавкаНДС 			= СтавкаНДС;
			СтрокаТЧДокумента.СуммаНДС				= УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаТЧДокумента.Сумма, НовыйДокумент.ЦенаВключаетНДС, ЗначениеСтавкиНДС);
			СтрокаТЧДокумента.СуммаСНДС 			= УчетНДСКлиентСервер.ПересчитатьЦенуПриИзмененииФлаговНалогов(
																				СтрокаТЧДокумента.Сумма, НовыйДокумент.ЦенаВключаетНДС, Истина, ЗначениеСтавкиНДС
																				);
			СтрокаТЧДокумента.СуммаВознаграждения 	= Строка.ВознаграждениеБезНДС + Строка.НДССВознаграждения;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Попытка
	
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Отчет комиссионера создан");
		Сообщение.Сообщить();
	
	Исключение
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не удалось провести отчет комиссионера. Подробное описание можно посмотреть в журнале регистрации");
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Не удалось провести отчет комиссионера Wildberries", 
									УровеньЖурналаРегистрации.Ошибка,,, СтрШаблон("Аккаунт: %1. Описание ошибки: %2", АккаунтМаркетплейса.Наименование, ОписаниеОшибки()));
	
	КонецПопытки;
	
	Возврат НовыйДокумент.Ссылка; 
	
КонецФункции

#КонецОбласти
